# MCaret2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..MCaret2 Property
SymbolTypeId Class See Also
---
Symbol m^2, indicating unit Square meters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MCaret2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MCaret2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MCaret2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace